Revit 2024 API
BoundingBoxIsInsideFilter.GetBoundingBox Method
 Gets the outline being used for this filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public Outline GetBoundingBox()
Visual Basic
Public Function GetBoundingBox As Outline
Visual C++
public:
Outline^ GetBoundingBox()
Return Value
 The outline being used for this filter.
See Also
BoundingBoxIsInsideFilter Class
Autodesk.Revit.DB Namespace